18_Advanced_Data_Grid_and_Awesome_Nested_Sets/rails/app/controllers/categories_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 3)
UPDATE "categories" SET "description" = 'some bags', "updated_at" = '2009-05-02 21:32:02' WHERE "id" = 3
---
  def update
    @category = Category.find(params[:id])
    if @category.update_attributes(params[:category])

SELECT * FROM "categories" WHERE ("categories"."id" = '3') LIMIT 1
---
  def move
     parent = Category.find_by_id(params[:category][:parent_id])